TexasInstruments/mcupsdk-core/examples/drivers/resolver/resolver_diagnostics/am263px-cc/r5fss0-0_nortos/example.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM263Px" --part "AM263P4" --package "ZCZ_S" --context "r5fss0-0" --product "MCU_PLUS_SDK@07.03.01"
 * @v2CliArgs --device "AM263P4-Q1" --package "NFBGA (ZCZ-S)" --context "r5fss0-0" --product "MCU_PLUS_SDK@07.03.01"
 * @versions {"tool":"1.21.2+3837"}
 */

/**
 * Import the modules used in this configuration.
 */
const eeprom             = scripting.addModule("/board/eeprom/eeprom", {}, false);
const eeprom1            = eeprom.addInstance();
const pmic               = scripting.addModule("/board/pmic/pmic", {}, false);
const pmic1              = pmic.addInstance();
const dac                = scripting.addModule("/drivers/dac/dac", {}, false);
const dac1               = dac.addInstance();
const epwm               = scripting.addModule("/drivers/epwm/epwm", {}, false);
const epwm1              = epwm.addInstance();
const epwm2              = epwm.addInstance();
const epwm3              = epwm.addInstance();
const epwm4              = epwm.addInstance();
const epwm5              = epwm.addInstance();
const epwm6              = epwm.addInstance();
const epwm7              = epwm.addInstance();
const epwm8              = epwm.addInstance();
const i2c                = scripting.addModule("/drivers/i2c/i2c", {}, false);
const i2c1               = i2c.addInstance();
const i2c2               = i2c.addInstance();
const mcspi              = scripting.addModule("/drivers/mcspi/mcspi", {}, false);
const mcspi1             = mcspi.addInstance();
const resolver           = scripting.addModule("/drivers/resolver/resolver", {}, false);
const resolver1          = resolver.addInstance();
const clock              = scripting.addModule("/kernel/dpl/clock");
const debug_log          = scripting.addModule("/kernel/dpl/debug_log");
const dpl_cfg            = scripting.addModule("/kernel/dpl/dpl_cfg");
const mpu_armv7          = scripting.addModule("/kernel/dpl/mpu_armv7", {}, false);
const mpu_armv71         = mpu_armv7.addInstance();
const mpu_armv72         = mpu_armv7.addInstance();
const mpu_armv73         = mpu_armv7.addInstance();
const mpu_armv74         = mpu_armv7.addInstance();
const mpu_armv75         = mpu_armv7.addInstance();
const mpu_armv76         = mpu_armv7.addInstance();
const default_linker     = scripting.addModule("/memory_configurator/default_linker", {}, false);
const default_linker1    = default_linker.addInstance();
const general            = scripting.addModule("/memory_configurator/general", {}, false);
const general1           = general.addInstance();
const region             = scripting.addModule("/memory_configurator/region", {}, false);
const region1            = region.addInstance();
const section            = scripting.addModule("/memory_configurator/section", {}, false);
const section1           = section.addInstance();
const section2           = section.addInstance();
const section3           = section.addInstance();
const section4           = section.addInstance();
const section5           = section.addInstance();
const section6           = section.addInstance();
const section7           = section.addInstance();
const section8           = section.addInstance();
const section9           = section.addInstance();
const section10          = section.addInstance();
const section11          = section.addInstance();
const section12          = section.addInstance();
const section13          = section.addInstance();
const epwm_syncout_xbar  = scripting.addModule("/xbar/epwm_syncout_xbar/epwm_syncout_xbar", {}, false);
const epwm_syncout_xbar1 = epwm_syncout_xbar.addInstance();
const int_xbar           = scripting.addModule("/xbar/int_xbar/int_xbar", {}, false);
const int_xbar1          = int_xbar.addInstance();
const int_xbar2          = int_xbar.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
eeprom1.$name = "CONFIG_EEPROM0";

pmic1.$name = "CONFIG_PMIC0";

dac1.$name        = "CONFIG_DAC0";
dac1.enableOutput = true;

epwm1.epwmTimebase_emulationMode                     = "EPWM_EMULATION_FREE_RUN";
epwm1.epwmTimebase_counterMode                       = "EPWM_COUNTER_MODE_UP";
epwm1.epwmEventTrigger_enableInterrupt               = true;
epwm1.epwmEventTrigger_interruptEventCount           = "1";
epwm1.epwmEventTrigger_interruptEventCountInitEnable = true;
epwm1.$name                                          = "ISR_SYNC_PWM_EPWM3";
epwm1.epwmTimebase_syncInPulseSource                 = "EPWM_SYNC_IN_PULSE_SRC_SYNCOUT_EPWM3";
epwm1.epwmTimebase_syncOutPulseMode                  = ["EPWM_SYNC_OUT_PULSE_ON_CNTR_ZERO","EPWM_SYNC_OUT_PULSE_ON_SOFTWARE"];
epwm1.epwmTimebase_period                            = 19999;
epwm1.EPWM.$assign                                   = "EPWM3";

epwm2.epwmTimebase_emulationMode                                 = "EPWM_EMULATION_FREE_RUN";
epwm2.epwmTimebase_counterMode                                   = "EPWM_COUNTER_MODE_UP_DOWN";
epwm2.epwmTimebase_phaseEnable                                   = true;
epwm2.epwmTimebase_phaseShift                                    = 1;
epwm2.epwmTimebase_syncInPulseSource                             = "EPWM_SYNC_IN_PULSE_SRC_SYNCOUT_EPWM3";
epwm2.epwmTimebase_period                                        = 5000;
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA   = "EPWM_AQ_OUTPUT_HIGH";
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_DOWN_CMPA = "EPWM_AQ_OUTPUT_LOW";
epwm2.epwmDeadband_enableRED                                     = true;
epwm2.epwmDeadband_enableFED                                     = true;
epwm2.epwmDeadband_delayRED                                      = 10;
epwm2.epwmDeadband_delayFED                                      = 10;
epwm2.epwmDeadband_polarityRED                                   = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm2.$name                                                      = "PWM_1A_EPMW0";
epwm2.EPWM.$assign                                               = "EPWM0";

epwm3.epwmTimebase_emulationMode                                 = "EPWM_EMULATION_FREE_RUN";
epwm3.epwmTimebase_counterMode                                   = "EPWM_COUNTER_MODE_UP_DOWN";
epwm3.epwmTimebase_phaseEnable                                   = true;
epwm3.epwmTimebase_phaseShift                                    = 1;
epwm3.epwmTimebase_syncInPulseSource                             = "EPWM_SYNC_IN_PULSE_SRC_SYNCOUT_EPWM3";
epwm3.epwmTimebase_period                                        = 5000;
epwm3.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA   = "EPWM_AQ_OUTPUT_HIGH";
epwm3.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_DOWN_CMPA = "EPWM_AQ_OUTPUT_LOW";
epwm3.epwmDeadband_enableRED                                     = true;
epwm3.epwmDeadband_enableFED                                     = true;
epwm3.epwmDeadband_delayRED                                      = 10;
epwm3.epwmDeadband_delayFED                                      = 10;
epwm3.epwmDeadband_polarityRED                                   = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm3.$name                                                      = "PWM_1B_EPMW1";
epwm3.EPWM.$assign                                               = "EPWM1";

epwm4.epwmTimebase_emulationMode                                 = "EPWM_EMULATION_FREE_RUN";
epwm4.epwmTimebase_counterMode                                   = "EPWM_COUNTER_MODE_UP_DOWN";
epwm4.epwmTimebase_phaseEnable                                   = true;
epwm4.epwmTimebase_phaseShift                                    = 1;
epwm4.epwmTimebase_syncInPulseSource                             = "EPWM_SYNC_IN_PULSE_SRC_SYNCOUT_EPWM3";
epwm4.epwmTimebase_period                                        = 5000;
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA   = "EPWM_AQ_OUTPUT_HIGH";
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_DOWN_CMPA = "EPWM_AQ_OUTPUT_LOW";
epwm4.epwmDeadband_enableRED                                     = true;
epwm4.epwmDeadband_enableFED                                     = true;
epwm4.epwmDeadband_delayRED                                      = 10;
epwm4.epwmDeadband_delayFED                                      = 10;
epwm4.epwmDeadband_polarityRED                                   = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm4.$name                                                      = "PWM_1C_EPMW2";
epwm4.EPWM.$assign                                               = "EPWM2";

epwm5.epwmTimebase_emulationMode                     = "EPWM_EMULATION_FREE_RUN";
epwm5.epwmTimebase_counterMode                       = "EPWM_COUNTER_MODE_UP";
epwm5.epwmEventTrigger_enableInterrupt               = true;
epwm5.epwmEventTrigger_interruptEventCount           = "1";
epwm5.epwmEventTrigger_interruptEventCountInitEnable = true;
epwm5.epwmTimebase_hsClockDiv                        = "EPWM_HSCLOCK_DIVIDER_10";
epwm5.epwmTimebase_clockDiv                          = "EPWM_CLOCK_DIVIDER_4";
epwm5.epwmTimebase_period                            = 49999;
epwm5.$name                                          = "DIAGNOSTICS_10MS_ISR_EPWM7";
epwm5.EPWM.$assign                                   = "EPWM7";

epwm6.epwmTimebase_emulationMode                                 = "EPWM_EMULATION_FREE_RUN";
epwm6.epwmTimebase_counterMode                                   = "EPWM_COUNTER_MODE_UP_DOWN";
epwm6.epwmTimebase_phaseEnable                                   = true;
epwm6.epwmTimebase_phaseShift                                    = 1;
epwm6.epwmTimebase_syncInPulseSource                             = "EPWM_SYNC_IN_PULSE_SRC_SYNCOUT_EPWM3";
epwm6.epwmTimebase_period                                        = 5000;
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA   = "EPWM_AQ_OUTPUT_HIGH";
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_DOWN_CMPA = "EPWM_AQ_OUTPUT_LOW";
epwm6.epwmDeadband_enableRED                                     = true;
epwm6.epwmDeadband_enableFED                                     = true;
epwm6.epwmDeadband_delayRED                                      = 10;
epwm6.epwmDeadband_delayFED                                      = 10;
epwm6.epwmDeadband_polarityRED                                   = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm6.$name                                                      = "PWM_2A_EPMW4";
epwm6.EPWM.$assign                                               = "EPWM4";

epwm7.epwmTimebase_emulationMode                                 = "EPWM_EMULATION_FREE_RUN";
epwm7.epwmTimebase_counterMode                                   = "EPWM_COUNTER_MODE_UP_DOWN";
epwm7.epwmTimebase_phaseEnable                                   = true;
epwm7.epwmTimebase_phaseShift                                    = 1;
epwm7.epwmTimebase_syncInPulseSource                             = "EPWM_SYNC_IN_PULSE_SRC_SYNCOUT_EPWM3";
epwm7.epwmTimebase_period                                        = 5000;
epwm7.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA   = "EPWM_AQ_OUTPUT_HIGH";
epwm7.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_DOWN_CMPA = "EPWM_AQ_OUTPUT_LOW";
epwm7.epwmDeadband_enableRED                                     = true;
epwm7.epwmDeadband_enableFED                                     = true;
epwm7.epwmDeadband_delayRED                                      = 10;
epwm7.epwmDeadband_delayFED                                      = 10;
epwm7.epwmDeadband_polarityRED                                   = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm7.$name                                                      = "PWM_2B_EPMW5";
epwm7.EPWM.$assign                                               = "EPWM5";

epwm8.epwmTimebase_emulationMode                                 = "EPWM_EMULATION_FREE_RUN";
epwm8.epwmTimebase_counterMode                                   = "EPWM_COUNTER_MODE_UP_DOWN";
epwm8.epwmTimebase_phaseEnable                                   = true;
epwm8.epwmTimebase_phaseShift                                    = 1;
epwm8.epwmTimebase_syncInPulseSource                             = "EPWM_SYNC_IN_PULSE_SRC_SYNCOUT_EPWM3";
epwm8.epwmTimebase_period                                        = 5000;
epwm8.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA   = "EPWM_AQ_OUTPUT_HIGH";
epwm8.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_DOWN_CMPA = "EPWM_AQ_OUTPUT_LOW";
epwm8.epwmDeadband_enableRED                                     = true;
epwm8.epwmDeadband_enableFED                                     = true;
epwm8.epwmDeadband_delayRED                                      = 10;
epwm8.epwmDeadband_delayFED                                      = 10;
epwm8.epwmDeadband_polarityRED                                   = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm8.$name                                                      = "PWM_2C_EPMW6";
epwm8.EPWM.$assign                                               = "EPWM6";

i2c1.$name           = "IOEXPANDER_I2C_INSTANCE";
i2c1.I2C.$assign     = "I2C2";
i2c1.I2C.SCL.$assign = "UART0_RTSn";
i2c1.I2C.SDA.$assign = "UART0_CTSn";
i2c1.I2C_child.$name = "drivers_i2c_v1_i2c_v1_template1";

i2c2.$name               = "EEPROM_I2C_INSTANCE";
eeprom1.peripheralDriver = i2c2;
i2c2.I2C.$assign         = "I2C0";
i2c2.I2C_child.$name     = "drivers_i2c_v1_i2c_v1_template2";

mcspi1.$name                 = "CONFIG_MCSPI0";
pmic1.peripheralDriver       = mcspi1;
mcspi1.SPI.$assign           = "SPI1";
mcspi1.mcspiChannel[0].$name = "CONFIG_MCSPI_CH0";
mcspi1.child.$name           = "drivers_mcspi_v1_mcspi_v1_template1";

