TexasInstruments/mcupsdk-core/examples/drivers/resolver/resolver_diagnostics/am263px-cc/r5fss0-0_nortos/example.syscfg
epwm_syncout_xbar1.$name      = "CONFIG_EPWM_SYNCOUT_XBAR0";
epwm_syncout_xbar1.instance   = "EPWM_SYNCOUT_XBAR_2";
epwm_syncout_xbar1.xbarOutput = ["EPWM3_SYNCOUT"];

int_xbar1.xbarOutput = ["EPWM3_INT"];
int_xbar1.$name      = "CONTROL_LOOP_INTXBAR0";

int_xbar2.instance   = "INT_XBAR_1";
int_xbar2.xbarOutput = ["EPWM7_INT"];
int_xbar2.$name      = "DIAGNOSTICS_INTXBAR1";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
epwm1.EPWM.A.$suggestSolution               = "EPWM3_A";
epwm1.EPWM.B.$suggestSolution               = "EPWM6_A";
epwm2.EPWM.A.$suggestSolution               = "EPWM0_A";
epwm2.EPWM.B.$suggestSolution               = "EPWM0_B";
epwm3.EPWM.A.$suggestSolution               = "EPWM1_A";
epwm3.EPWM.B.$suggestSolution               = "EPWM4_B";
epwm4.EPWM.A.$suggestSolution               = "EPWM2_A";
epwm4.EPWM.B.$suggestSolution               = "EPWM2_B";
epwm5.EPWM.A.$suggestSolution               = "EPWM7_A";
epwm5.EPWM.B.$suggestSolution               = "EPWM10_A";
epwm6.EPWM.A.$suggestSolution               = "EPWM4_A";
epwm6.EPWM.B.$suggestSolution               = "EPWM1_B";
epwm7.EPWM.A.$suggestSolution               = "EPWM5_A";
epwm7.EPWM.B.$suggestSolution               = "EPWM5_B";
epwm8.EPWM.A.$suggestSolution               = "EPWM3_B";
epwm8.EPWM.B.$suggestSolution               = "EPWM6_B";
i2c2.I2C.SCL.$suggestSolution               = "I2C0_SCL";
i2c2.I2C.SDA.$suggestSolution               = "I2C0_SDA";
mcspi1.SPI.CLK.$suggestSolution             = "SPI1_CLK";
mcspi1.SPI.D0.$suggestSolution              = "SPI1_D0";
mcspi1.SPI.D1.$suggestSolution              = "SPI1_D1";
mcspi1.mcspiChannel[0].CSn.$suggestSolution = "SPI1_CS0";
resolver1.RESOLVER.$suggestSolution         = "RESOLVER";
resolver1.RESOLVER.PWM1.$suggestSolution    = "PR0_PRU1_GPIO14";
